; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v12 ?v2)
             (pred_5 ?v5 ?v11)
             (pred_3 ?v12 ?v11)
             (pred_1 ?v1 ?v12 )
	     (pred_7 ?v12)
             (pred_10 ?v8)
             (pred_9 ?v5)
             (pred_8 ?v11)
             (pred_6 ?v12)
             (pred_11 ?v5)
             (pred_2 ?v12)
             (pred_4 ))



(:action op_4
:parameters (?v3 ?v7 ?v13 ?v4)
:precondition (and (pred_10 ?v3) (pred_10 ?v7) (pred_9 ?v13) (pred_8 ?v4)
          (pred_12 ?v3 ?v7) (pred_5 ?v13 ?v4)
                   (pred_3 ?v7 ?v4) (pred_7 ?v3) 
                   (pred_6 ?v7) (pred_11 ?v13))
:effect (and  (pred_2 ?v7) (not (pred_6 ?v7))))


(:action op_3
:parameters (?v3 ?v10)
:precondition (and (pred_10 ?v3) (pred_10 ?v10)
               (pred_7 ?v3) (pred_12 ?v3 ?v10) (pred_2 ?v10))
:effect (and (pred_7 ?v10) (not (pred_7 ?v3))))

(:action op_1
:parameters (?v3 ?v13)
:precondition (and (pred_10 ?v3) (pred_9 ?v13) 
                  (pred_7 ?v3) (pred_1 ?v13 ?v3) (pred_4 ))
:effect (and (pred_11 ?v13)
   (not (pred_1 ?v13 ?v3)) (not (pred_4 ))))


(:action op_5
:parameters (?v3 ?v9 ?v6)
:precondition (and (pred_10 ?v3) (pred_9 ?v9) (pred_9 ?v6)
                  (pred_7 ?v3) (pred_11 ?v6) (pred_1 ?v9 ?v3))
:effect (and (pred_11 ?v9) (pred_1 ?v6 ?v3)
        (not (pred_11 ?v6)) (not (pred_1 ?v9 ?v3))))

(:action op_2
:parameters (?v3 ?v13)
:precondition (and (pred_10 ?v3) (pred_9 ?v13) 
                  (pred_7 ?v3) (pred_11 ?v13))
:effect (and (pred_4 ) (pred_1 ?v13 ?v3) (not (pred_11 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_30 obj_06 obj_12 obj_27 obj_21 obj_03 obj_02 obj_28 obj_23 obj_17 obj_14 obj_26 obj_19 obj_09 obj_10 obj_07 obj_08 obj_31 obj_11 obj_20 obj_22 obj_25 obj_16 obj_04
    obj_29 obj_24 obj_01
    obj_15 obj_13 obj_18
    )

    (:init
       (pred_4)

       (pred_10 obj_05)
       (pred_10 obj_30)
       (pred_10 obj_06)
       (pred_10 obj_12)
       (pred_10 obj_27)
       (pred_10 obj_21)
       (pred_10 obj_03)
       (pred_10 obj_02)
       (pred_10 obj_28)
       (pred_10 obj_23)
       (pred_10 obj_17)
       (pred_10 obj_14)
       (pred_10 obj_26)
       (pred_10 obj_19)
       (pred_10 obj_09)
       (pred_10 obj_10)
       (pred_10 obj_07)
       (pred_10 obj_08)
       (pred_10 obj_31)
       (pred_10 obj_11)
       (pred_10 obj_20)
       (pred_10 obj_22)
       (pred_10 obj_25)
       (pred_10 obj_16)
       (pred_10 obj_04)
       (pred_8 obj_29)
       (pred_8 obj_24)
       (pred_8 obj_01)
       (pred_9 obj_15)
       (pred_9 obj_13)
       (pred_9 obj_18)

       (pred_12 obj_05 obj_21)
       (pred_12 obj_05 obj_30)
       (pred_12 obj_30 obj_03)
       (pred_12 obj_30 obj_06)
       (pred_12 obj_30 obj_05)
       (pred_12 obj_06 obj_02)
       (pred_12 obj_06 obj_12)
       (pred_12 obj_06 obj_30)
       (pred_12 obj_12 obj_28)
       (pred_12 obj_12 obj_27)
       (pred_12 obj_12 obj_06)
       (pred_12 obj_27 obj_23)
       (pred_12 obj_27 obj_12)
       (pred_12 obj_21 obj_17)
       (pred_12 obj_21 obj_03)
       (pred_12 obj_21 obj_05)
       (pred_12 obj_03 obj_14)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_03 obj_30)
       (pred_12 obj_03 obj_21)
       (pred_12 obj_02 obj_26)
       (pred_12 obj_02 obj_28)
       (pred_12 obj_02 obj_06)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_28 obj_19)
       (pred_12 obj_28 obj_23)
       (pred_12 obj_28 obj_12)
       (pred_12 obj_28 obj_02)
       (pred_12 obj_23 obj_09)
       (pred_12 obj_23 obj_27)
       (pred_12 obj_23 obj_28)
       (pred_12 obj_17 obj_10)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_17 obj_21)
       (pred_12 obj_14 obj_07)
       (pred_12 obj_14 obj_26)
       (pred_12 obj_14 obj_03)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_26 obj_08)
       (pred_12 obj_26 obj_19)
       (pred_12 obj_26 obj_02)
       (pred_12 obj_26 obj_14)
       (pred_12 obj_19 obj_31)
       (pred_12 obj_19 obj_09)
       (pred_12 obj_19 obj_28)
       (pred_12 obj_19 obj_26)
       (pred_12 obj_09 obj_11)
       (pred_12 obj_09 obj_23)
       (pred_12 obj_09 obj_19)
       (pred_12 obj_10 obj_20)
       (pred_12 obj_10 obj_07)
       (pred_12 obj_10 obj_17)
       (pred_12 obj_07 obj_22)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_07 obj_14)
       (pred_12 obj_07 obj_10)
       (pred_12 obj_08 obj_25)
       (pred_12 obj_08 obj_31)
       (pred_12 obj_08 obj_26)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_31 obj_16)
       (pred_12 obj_31 obj_11)
       (pred_12 obj_31 obj_19)
       (pred_12 obj_31 obj_08)
       (pred_12 obj_11 obj_04)
       (pred_12 obj_11 obj_09)
       (pred_12 obj_11 obj_31)
       (pred_12 obj_20 obj_22)
       (pred_12 obj_20 obj_10)
       (pred_12 obj_22 obj_25)
       (pred_12 obj_22 obj_07)
       (pred_12 obj_22 obj_20)
       (pred_12 obj_25 obj_16)
       (pred_12 obj_25 obj_08)
       (pred_12 obj_25 obj_22)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_16 obj_31)
       (pred_12 obj_16 obj_25)
       (pred_12 obj_04 obj_11)
       (pred_12 obj_04 obj_16)
       (pred_6 obj_22)
       (pred_6 obj_09)
       (pred_6 obj_30)
       (pred_3  obj_22 obj_29)
       (pred_3  obj_09 obj_24)
       (pred_3  obj_30 obj_01)
       (pred_2 obj_05)
       (pred_2 obj_06)
       (pred_2 obj_12)
       (pred_2 obj_27)
       (pred_2 obj_21)
       (pred_2 obj_03)
       (pred_2 obj_02)
       (pred_2 obj_28)
       (pred_2 obj_23)
       (pred_2 obj_17)
       (pred_2 obj_14)
       (pred_2 obj_26)
       (pred_2 obj_19)
       (pred_2 obj_10)
       (pred_2 obj_07)
       (pred_2 obj_08)
       (pred_2 obj_31)
       (pred_2 obj_11)
       (pred_2 obj_20)
       (pred_2 obj_25)
       (pred_2 obj_16)
       (pred_2 obj_04)

       (pred_5  obj_15 obj_29)
       (pred_5  obj_13 obj_24)
       (pred_5  obj_18 obj_01)
       (pred_1 obj_15 obj_25)
       (pred_1 obj_13 obj_08)
       (pred_1 obj_18 obj_28)
       (pred_7 obj_14)
    )

    (:goal (and
       (pred_1 obj_15 obj_17)
       (pred_1 obj_18 obj_07)
    ))
(:constraints
  (always (not (pred_7 obj_02)))
)
)

; plan
1. (op_3 obj_14 obj_26)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_26)
   goals met: 0 of 2
2. (op_3 obj_26 obj_08)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_08)
   goals met: 0 of 2
3. (op_3 obj_08 obj_25)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_25)
   goals met: 0 of 2
4. (op_1 obj_25 obj_15)
   deleted: (pred_1 obj_15 obj_25) (pred_4)
   added: (pred_11 obj_15)
   goals met: 0 of 2
5. (op_3 obj_25 obj_08)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_08)
   goals met: 0 of 2
6. (op_3 obj_08 obj_07)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_07)
   goals met: 0 of 2
7. (op_3 obj_07 obj_14)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_14)
   goals met: 0 of 2
8. (op_3 obj_14 obj_17)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_17)
   goals met: 0 of 2
9. (op_2 obj_17 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_4) (pred_1 obj_15 obj_17)
   goals met: 1 of 2
10. (op_3 obj_17 obj_14)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_14)
   goals met: 1 of 2
11. (op_3 obj_14 obj_26)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_26)
   goals met: 1 of 2
12. (op_3 obj_26 obj_19)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_19)
   goals met: 1 of 2
13. (op_3 obj_19 obj_28)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_28)
   goals met: 1 of 2
14. (op_1 obj_28 obj_18)
   deleted: (pred_1 obj_18 obj_28) (pred_4)
   added: (pred_11 obj_18)
   goals met: 1 of 2
15. (op_3 obj_28 obj_19)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_19)
   goals met: 1 of 2
16. (op_3 obj_19 obj_26)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_26)
   goals met: 1 of 2
17. (op_3 obj_26 obj_14)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_14)
   goals met: 1 of 2
18. (op_3 obj_14 obj_07)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_07)
   goals met: 1 of 2
19. (op_2 obj_07 obj_18)
   deleted: (pred_11 obj_18)
   added: (pred_4) (pred_1 obj_18 obj_07)
   goals met: 2 of 2
